#### Terraform Validation & Plan Results
* Terraform Version 📎`1.4.2`
* Working Directory 📂`./code/data-landing-zone`
* Terraform Initialization ⚙️`success`
* Terraform Validation 🤖`success`
* Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1mmodule.data_products["test.yml"].time_rotating.rotation: Refreshing state... [id=2023-04-19T09:58:39Z][0m
[0m[1mmodule.shir_001.random_password.password: Refreshing state... [id=none][0m
[0m[1mazurerm_resource_group.management_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-mgmt-rg][0m
[0m[1mmodule.databricks_experimentation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_enriched.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_automation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_route_table.route_table: Reading...[0m[0m
[0m[1mazurerm_resource_group.shared_app_exp_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg][0m
[0m[1mmodule.data_products["test.yml"].azurerm_resource_group.data_product_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg][0m
[0m[1mmodule.databricks_automation_configuration.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.databricks_automation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mdata.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_experimentation.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_automation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.databricks_experimentation_configuration.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_curated.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_enriched.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_workspace.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_network_security_group.network_security_group: Reading...[0m[0m
[0m[1mmodule.datalake_workspace.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.datalake_raw.data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mmodule.datalake_curated.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mazurerm_resource_group.runtimes_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_client_config.current: Reading...[0m[0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mazurerm_resource_group.storage_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg][0m
[0m[1mmodule.datalake_raw.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1iYWFhNzg4NS05MGQ5LTQ5YTYtYmZmMC1jMTJlYzczOGJmOWI7b2JqZWN0SWQ9ZTlmOGE5ZDUtMmI0ZC00ZDY1LTg1ZTMtZGNiNmVmNDk4OGJlO3N1YnNjcmlwdGlvbklkPThmMTcxZmY5LTJiNWItNGYwZi1hZWQ1LTdmYTM2MGExZDA5NDt0ZW5hbnRJZD0zNTU2YmU3OS0yOTc5LTRiMTktYTFhZi00ZGQ0ZTZkOWVkN2U=][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_route_table.route_table: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/routeTables/mycrp-prd-dlz01-rt001][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_network_security_group.network_security_group: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/networkSecurityGroups/mycrp-prd-dlz01-nsg001][0m
[0m[1mazurerm_resource_group.shared_app_aut_rg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg][0m
[0m[1mazurerm_data_factory.data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001][0m
[0m[1mmodule.datalake_enriched.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr][0m
[0m[1mdata.azurerm_virtual_network.virtual_network: Read complete after 1s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001][0m
[0m[1mmodule.databricks_experimentation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001][0m
[0m[1mmodule.datalake_curated.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur][0m
[0m[1mmodule.data_products["test.yml"].azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001][0m
[0m[1mmodule.datalake_workspace.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp][0m
[0m[1mmodule.data_products["test.yml"].azurerm_databricks_access_connector.databricks_access_connector[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Databricks/accessConnectors/test-prd-dbac001][0m
[0m[1mmodule.datalake_raw.azurerm_storage_account.datalake: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw][0m
[0m[1mazurerm_subnet.databricks_public_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mazurerm_subnet.shared_app_aut_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mazurerm_subnet.databricks_private_subnet_002: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mazurerm_subnet.devops_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mmodule.data_products["test.yml"].azurerm_user_assigned_identity.user_assigned_identity[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/test-prd-uai001][0m
[0m[1mazurerm_subnet.runtimes_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mazurerm_subnet.databricks_public_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mazurerm_subnet.databricks_private_subnet_001: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mazurerm_subnet.powerbi_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet.shared_app_exp_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mazurerm_subnet.storage_subnet: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mazurerm_subnet_route_table_association.databricks_public_subnet_002_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_public_subnet_002_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet002][0m
[0m[1mazurerm_subnet_network_security_group_association.shared_app_aut_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mazurerm_subnet_route_table_association.shared_app_aut_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppAutomationSubnet][0m
[0m[1mazurerm_subnet_route_table_association.databricks_private_subnet_002_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mmodule.databricks_experimentation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_private_subnet_002_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet002][0m
[0m[1mmodule.databricks_automation.data.azuread_service_principal.databricks: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azuread_client_config.current: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azuread_group.security_group[0]: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azuread_client_config.current: Read complete after 0s [id=3556be79-2979-4b19-a1af-4dd4e6d9ed7e-baaa7885-90d9-49a6-bff0-c12ec738bf9b-e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be][0m
[0m[1mazurerm_subnet_network_security_group_association.devops_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint_data_factory: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-adf001-datafactory-pe][0m
[0m[1mazurerm_private_endpoint.data_factory_private_endpoint_portal: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-adf001-portal-pe][0m
[0m[1mmodule.databricks_experimentation.data.azuread_service_principal.databricks: Read complete after 0s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mazurerm_subnet_route_table_association.runtimes_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.runtimes_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/RuntimesSubnet][0m
[0m[1mazurerm_subnet_route_table_association.devops_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DevOpsSubnet][0m
[0m[1mazurerm_subnet_route_table_association.databricks_private_subnet_001_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mazurerm_subnet_route_table_association.databricks_public_subnet_001_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_private_subnet_001_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPrivateSubnet001][0m
[0m[1mazurerm_subnet_network_security_group_association.databricks_public_subnet_001_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DatabricksPublicSubnet001][0m
[0m[1mmodule.databricks_automation.azurerm_key_vault.key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001][0m
[0m[1mmodule.databricks_automation.data.azuread_service_principal.databricks: Read complete after 1s [id=646e1bfe-cf17-4fdc-afd8-3992fda82399][0m
[0m[1mazurerm_subnet_network_security_group_association.powerbi_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet_route_table_association.powerbi_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/PowerBiSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.shared_app_exp_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mazurerm_subnet_route_table_association.shared_app_exp_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/SharedAppExperimentationSubnet][0m
[0m[1mazurerm_subnet_network_security_group_association.storage_subnet_nsg: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mazurerm_subnet_route_table_association.storage_subnet_routetable: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/StorageSubnet][0m
[0m[1mmodule.data_products["test.yml"].azuread_application.application[0]: Refreshing state... [id=f40534d3-c31f-4df8-ab9d-c4c45cbf7cda][0m
[0m[1mmodule.databricks_experimentation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/ca7ccc96-197c-f8d6-fa39-5a7777ee0b7b][0m
[0m[1mmodule.shir_001.azurerm_lb.lb: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_virtual_network.virtual_network: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/1ed03e24-4a7f-e600-c1b7-2bd3cec0e000][0m
[0m[1mmodule.datalake_workspace.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/blobServices/default/containers/data][0m
[0m[1mmodule.shir_001.data.azurerm_data_factory.data_factory: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-kv001-pe][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_virtual_network.virtual_network: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_queue[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-queue-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/managementPolicies/default][0m
[0m[1mmodule.shir_001.data.azurerm_data_factory.data_factory: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001][0m
[0m[1mmodule.databricks_experimentation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-exp-dbw001][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_table[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-table-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-blob-pe][0m
[0m[1mmodule.datalake_workspace.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstwsp-dfs-pe][0m
[0m[1mmodule.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstenr-blob-pe][0m
[0m[1mmodule.datalake_enriched.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstenr-dfs-pe][0m
[0m[1mmodule.data_products["test.yml"].data.azuread_group.security_group[0]: Read complete after 1s [id=238f1be3-8722-41ab-ac00-0ac9b8703915][0m
[0m[1mmodule.datalake_enriched.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr/managementPolicies/default][0m
[0m[1mmodule.datalake_enriched.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr/blobServices/default/containers/data][0m
[0m[1mmodule.databricks_automation.azurerm_databricks_workspace.databricks: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Databricks/workspaces/mydlz01-dev-aut-dbw001][0m
[0m[1mmodule.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstcur-blob-pe][0m
[0m[1mmodule.datalake_curated.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur/blobServices/default/containers/data][0m
[0m[1mmodule.datalake_curated.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstcur-dfs-pe][0m
[0m[1mmodule.datalake_curated.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur/managementPolicies/default][0m
[0m[1mmodule.datalake_raw.azurerm_storage_management_policy.datalake_management_policy: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw/managementPolicies/default][0m
[0m[1mmodule.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstraw-dfs-pe][0m
[0m[1mmodule.datalake_raw.azurerm_private_endpoint.datalake_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Network/privateEndpoints/mydlz01devstraw-blob-pe][0m
[0m[1mmodule.datalake_raw.azapi_resource.datalake_containers["data"]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw/blobServices/default/containers/data][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.subnet[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DataProductSubnet-test-prd][0m
[0m[1mmodule.shir_001.azurerm_lb_probe.lb_probe: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/probes/mydlz01-dev-shir001-probe][0m
[0m[1mmodule.shir_001.azurerm_lb_backend_address_pool.lb_backend_address_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/backendAddressPools/mydlz01-dev-shir001-backendaddresspool][0m
[0m[1mmodule.shir_001.azurerm_lb_nat_pool.lb_nat_pool: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/inboundNatPools/mydlz01-dev-shir001-natpool][0m
[0m[1mmodule.shir_001.azurerm_data_factory_integration_runtime_self_hosted.data_factory_shir: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.DataFactory/factories/mydlz01-dev-adf001/integrationruntimes/mydlz01-dev-shir001][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-blob-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-uiapi-pe][0m
[0m[1mmodule.databricks_experimentation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-exp-dbw001-dfs-pe][0m
[0m[1mmodule.data_products["test.yml"].azuread_group_member.security_group_uai_member[0]: Refreshing state... [id=238f1be3-8722-41ab-ac00-0ac9b8703915/member/4a38ae94-6ff3-45c9-bfb4-ec756fdfcd5d][0m
[0m[1mmodule.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_resource_group[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Authorization/roleAssignments/4f995df7-15f2-e9e1-68e5-eba44291e2d9][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_security_group_object_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/securityGroupObjectId][0m
[0m[1mmodule.data_products["test.yml"].azuread_group_member.security_group_dbac_member[0]: Refreshing state... [id=238f1be3-8722-41ab-ac00-0ac9b8703915/member/6d2bf5cb-0c4b-4b1c-a696-1bf0ad88fb90][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_security_group_display_name[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/securityGroupDisplayName][0m
[0m[1mmodule.data_products["test.yml"].azuread_service_principal.service_principal[0]: Refreshing state... [id=56c1256c-3efb-4f70-8414-4d139b681e83][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_object_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalObjectId][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_blob: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-blob-pe][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_ui: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-uiapi-pe][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.databricks_private_endpoint_dfs: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-dbw001-dfs-pe][0m
[0m[1mmodule.databricks_automation.azurerm_role_assignment.databricks_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/7676dddf-ebc9-97f9-5d42-b1bb838c0b00][0m
[0m[1mmodule.databricks_automation.azurerm_private_endpoint.key_vault_private_endpoint: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.Network/privateEndpoints/mydlz01-dev-aut-kv001-pe][0m
[0m[1mmodule.databricks_automation.azurerm_role_assignment.client_roleassignment_key_vault: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/8cd998e9-6266-d2ed-515b-33f10fa9086a][0m
[0m[1mmodule.shir_001.azurerm_lb_rule.lb_rule: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Network/loadBalancers/mydlz01-dev-shir001-lb/loadBalancingRules/mydlz01-dev-shir001-rule][0m
[0m[1mmodule.shir_001.azurerm_windows_virtual_machine_scale_set.vmss: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-runtimes-rg/providers/Microsoft.Compute/virtualMachineScaleSets/mydlz01-dev-shir001][0m
[0m[1mmodule.data_products["test.yml"].azurerm_private_endpoint.key_vault_private_endpoint[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Network/privateEndpoints/test-prd-vault001-pe][0m
[0m[1mmodule.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_subnet[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mycrp-prd-dlz01-network-rg/providers/Microsoft.Network/virtualNetworks/mycrp-prd-dlz01-vnet001/subnets/DataProductSubnet-test-prd/providers/Microsoft.Authorization/roleAssignments/82637dec-fd1f-0b48-ea82-6dc53d5ee0df][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_workspace: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_enriched: Reading...[0m[0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_curated: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_raw: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=E964305C0B000001][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=E964305C0B000000][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_workspace: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_curated: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstcur][0m
[0m[1mmodule.databricks_experimentation_configuration.data.databricks_current_user.current_user: Reading...[0m[0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=2769391400051353|9884193e-1edc-4ddd-8e9c-ce570e9cc57a][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_enriched: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstenr][0m
[0m[1mmodule.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_all_purpose: Refreshing state... [id=E963F6819300179D][0m
[0m[1mmodule.data_products["test.yml"].data.azurerm_storage_account.datalake_raw: Read complete after 0s [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstraw][0m
[0m[1mmodule.databricks_automation_configuration.databricks_secret_scope.platform_secret_scope: Refreshing state... [id=platform-secret-scope][0m
[0m[1mmodule.databricks_automation_configuration.data.databricks_current_user.current_user: Reading...[0m[0m
[0m[1mmodule.databricks_automation_configuration.databricks_cluster_policy.cluster_policy_job: Refreshing state... [id=E963F6819300179E][0m
[0m[1mmodule.databricks_automation_configuration.databricks_metastore_assignment.metastore_assignment[0]: Refreshing state... [id=4175911308037159|9884193e-1edc-4ddd-8e9c-ce570e9cc57a][0m
[0m[1mmodule.data_products["test.yml"].databricks_storage_credential.automation_storage_credential[0]: Refreshing state... [id=test-prd][0m
[0m[1mmodule.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_storage_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/providers/Microsoft.Authorization/roleAssignments/9a8c82be-5029-4b44-7b13-5a511885cf68][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.container_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/blobServices/default/containers/test-prd][0m
[0m[1mmodule.data_products["test.yml"].azuread_group_member.security_group_sp_member[0]: Refreshing state... [id=238f1be3-8722-41ab-ac00-0ac9b8703915/member/56c1256c-3efb-4f70-8414-4d139b681e83][0m
[0m[1mmodule.data_products["test.yml"].azuread_service_principal_password.service_principal_password[0]: Refreshing state... [id=56c1256c-3efb-4f70-8414-4d139b681e83/password/9826a6da-9e12-4919-a0ec-6c5e1cc1f676][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_client_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalClientId][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_tenant_id[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalTenantId][0m
[0m[1mmodule.data_products["test.yml"].azurerm_role_assignment.user_assigned_identity_roleassignment_container_workspace[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-storage-rg/providers/Microsoft.Storage/storageAccounts/mydlz01devstwsp/blobServices/default/containers/test-prd/providers/Microsoft.Authorization/roleAssignments/2dbc2207-5246-f4ab-6a14-2001141e987c][0m
[0m[1mmodule.data_products["test.yml"].azapi_resource.key_vault_secret_service_principal_client_secret[0]: Refreshing state... [id=/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.KeyVault/vaults/test-prd-vault001/secrets/servicePrincipalClientSecret][0m
[0m[1mmodule.data_products["test.yml"].databricks_external_location.automation_external_location[0]: Refreshing state... [id=test-prd][0m
[0m[1mmodule.data_products["test.yml"].databricks_catalog.automation_catalog[0]: Refreshing state... [id=test-prd][0m
[0m[1mmodule.data_products["test.yml"].databricks_grants.grants_automation_catalog[0]: Refreshing state... [id=catalog/test-prd][0m
[0m[1mmodule.databricks_automation_configuration.data.databricks_current_user.current_user: Read complete after 2s [id=2616621899169361][0m
[0m[1mmodule.databricks_automation_configuration.databricks_grants.grants_current_user: Refreshing state... [id=metastore/9884193e-1edc-4ddd-8e9c-ce570e9cc57a][0m
[0m[1mmodule.databricks_experimentation_configuration.data.databricks_current_user.current_user: Read complete after 2s [id=2616621899169361][0m
[0m[1mmodule.databricks_experimentation_configuration.databricks_grants.grants_current_user: Refreshing state... [id=metastore/9884193e-1edc-4ddd-8e9c-ce570e9cc57a][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
[31m-[0m/[32m+[0m destroy and then create replacement[0m

Terraform will perform the following actions:

[1m  # module.data_products["test.yml"].azuread_application.application[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azuread_application" "application" {
        id                             = "f40534d3-c31f-4df8-ab9d-c4c45cbf7cda"
      [33m~[0m[0m owners                         = [
          [31m-[0m[0m "ab5172e1-da66-42da-b711-ff01dd130576",
          [32m+[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be",
        ]
        tags                           = []
        [90m# (15 unchanged attributes hidden)[0m[0m

        [90m# (6 unchanged blocks hidden)[0m[0m
    }

[1m  # module.data_products["test.yml"].azuread_service_principal.service_principal[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "azuread_service_principal" "service_principal" {
        id                           = "56c1256c-3efb-4f70-8414-4d139b681e83"
      [33m~[0m[0m owners                       = [
          [31m-[0m[0m "ab5172e1-da66-42da-b711-ff01dd130576",
          [32m+[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be",
        ]
        tags                         = []
        [90m# (18 unchanged attributes hidden)[0m[0m

        [90m# (3 unchanged blocks hidden)[0m[0m
    }

[1m  # module.data_products["test.yml"].databricks_catalog.automation_catalog[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_catalog" "automation_catalog" {
      [32m+[0m[0m comment       = "Data Product Catalog - test-prd"
      [32m+[0m[0m force_destroy = false
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m metastore_id  = "9884193e-1edc-4ddd-8e9c-ce570e9cc57a"
      [32m+[0m[0m name          = "test-prd"
      [32m+[0m[0m owner         = (known after apply)
      [32m+[0m[0m properties    = {
          [32m+[0m[0m "purpose" = "Data Product Catalog - test-prd"
        }
      [32m+[0m[0m storage_root  = "abfss://test-prd@mydlz01devstwsp.dfs.core.windows.net"
    }

[1m  # module.data_products["test.yml"].databricks_external_location.automation_external_location[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_external_location" "automation_external_location" {
      [32m+[0m[0m comment         = "Default Storage for test-prd Data Product"
      [32m+[0m[0m credential_name = "test-prd"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m metastore_id    = (known after apply)
      [32m+[0m[0m name            = "test-prd"
      [32m+[0m[0m owner           = (known after apply)
      [32m+[0m[0m skip_validation = false
      [32m+[0m[0m url             = "abfss://test-prd@mydlz01devstwsp.dfs.core.windows.net"
    }

[1m  # module.data_products["test.yml"].databricks_grants.grants_automation_catalog[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_grants" "grants_automation_catalog" {
      [32m+[0m[0m catalog = "test-prd"
      [32m+[0m[0m id      = (known after apply)

      [32m+[0m[0m grant {
          [32m+[0m[0m principal  = "test"
          [32m+[0m[0m privileges = [
              [32m+[0m[0m "ALL_PRIVILEGES",
            ]
        }
    }

[1m  # module.data_products["test.yml"].databricks_storage_credential.automation_storage_credential[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_storage_credential" "automation_storage_credential" {
      [32m+[0m[0m comment      = "Managed identity credential for test-prd Data Product"
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m metastore_id = (known after apply)
      [32m+[0m[0m name         = "test-prd"
      [32m+[0m[0m owner        = (known after apply)

      [32m+[0m[0m azure_managed_identity {
          [32m+[0m[0m access_connector_id = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/test-prd-rg/providers/Microsoft.Databricks/accessConnectors/test-prd-dbac001"
        }
    }

[1m  # module.databricks_automation.azurerm_role_assignment.client_roleassignment_key_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "client_roleassignment_key_vault" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-aut-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-aut-kv001/providers/Microsoft.Authorization/roleAssignments/8cd998e9-6266-d2ed-515b-33f10fa9086a" -> (known after apply)
      [33m~[0m[0m name                             = "8cd998e9-6266-d2ed-515b-33f10fa9086a" -> (known after apply)
      [33m~[0m[0m principal_id                     = "4b2b1e10-7c49-4334-80dd-ab4242b73503" [33m->[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be" [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_type                   = "ServicePrincipal" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.databricks_automation_configuration.databricks_grants.grants_current_user[0m will be created
[0m  [32m+[0m[0m resource "databricks_grants" "grants_current_user" {
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m metastore = "9884193e-1edc-4ddd-8e9c-ce570e9cc57a"

      [32m+[0m[0m grant {
          [32m+[0m[0m principal  = "baaa7885-90d9-49a6-bff0-c12ec738bf9b"
          [32m+[0m[0m privileges = [
              [32m+[0m[0m "CREATE_CATALOG",
              [32m+[0m[0m "CREATE_EXTERNAL_LOCATION",
            ]
        }
    }

[1m  # module.databricks_automation_configuration.databricks_metastore_assignment.metastore_assignment[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_metastore_assignment" "metastore_assignment" {
      [32m+[0m[0m default_catalog_name = "perfectthymetech-northeurope"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m metastore_id         = "9884193e-1edc-4ddd-8e9c-ce570e9cc57a"
      [32m+[0m[0m workspace_id         = 4175911308037159
    }

[1m  # module.databricks_experimentation.azurerm_role_assignment.client_roleassignment_key_vault[0m must be [1m[31mreplaced[0m
[0m[31m-[0m/[32m+[0m[0m resource "azurerm_role_assignment" "client_roleassignment_key_vault" {
      [33m~[0m[0m id                               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/resourceGroups/mydlz01-dev-shared-app-exp-rg/providers/Microsoft.KeyVault/vaults/mydlz01-dev-exp-kv001/providers/Microsoft.Authorization/roleAssignments/ca7ccc96-197c-f8d6-fa39-5a7777ee0b7b" -> (known after apply)
      [33m~[0m[0m name                             = "ca7ccc96-197c-f8d6-fa39-5a7777ee0b7b" -> (known after apply)
      [33m~[0m[0m principal_id                     = "4b2b1e10-7c49-4334-80dd-ab4242b73503" [33m->[0m[0m "e9f8a9d5-2b4d-4d65-85e3-dcb6ef4988be" [31m# forces replacement[0m[0m
      [33m~[0m[0m principal_type                   = "ServicePrincipal" -> (known after apply)
      [33m~[0m[0m role_definition_id               = "/subscriptions/8f171ff9-2b5b-4f0f-aed5-7fa360a1d094/providers/Microsoft.Authorization/roleDefinitions/b86a8fe4-44ce-4948-aee5-eccb2c155cd7" -> (known after apply)
      [32m+[0m[0m skip_service_principal_aad_check = (known after apply)
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.databricks_experimentation_configuration.databricks_grants.grants_current_user[0m will be created
[0m  [32m+[0m[0m resource "databricks_grants" "grants_current_user" {
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m metastore = "9884193e-1edc-4ddd-8e9c-ce570e9cc57a"

      [32m+[0m[0m grant {
          [32m+[0m[0m principal  = "baaa7885-90d9-49a6-bff0-c12ec738bf9b"
          [32m+[0m[0m privileges = [
              [32m+[0m[0m "CREATE_CATALOG",
              [32m+[0m[0m "CREATE_EXTERNAL_LOCATION",
            ]
        }
    }

[1m  # module.databricks_experimentation_configuration.databricks_metastore_assignment.metastore_assignment[0][0m will be created
[0m  [32m+[0m[0m resource "databricks_metastore_assignment" "metastore_assignment" {
      [32m+[0m[0m default_catalog_name = "perfectthymetech-northeurope"
      [32m+[0m[0m id                   = (known after apply)
      [32m+[0m[0m metastore_id         = "9884193e-1edc-4ddd-8e9c-ce570e9cc57a"
      [32m+[0m[0m workspace_id         = 2769391400051353
    }

[1mPlan:[0m 10 to add, 2 to change, 2 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>